---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.InsulationType
source: html/14581946-b8e7-4e95-2a9b-dda2218fb230.htm
---
# Autodesk.Revit.DB.FabricationPart.InsulationType Property

The insulation type of the fabrication part.

## Syntax (C#)
```csharp
public string InsulationType { get; }
```